nxp-mcuxpresso/mcux-soc-svd/MCXN546T/MCXN546T_cm33_core0.xml
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RESFIFO[%s]</name>
          <description>Data Result FIFO Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSRC</name>
              <description>Trigger Source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIGGER_0</name>
                  <description>Trigger source 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_1</name>
                  <description>Trigger source 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_2</name>
                  <description>Trigger source 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_3</name>
                  <description>Trigger source 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPCNT</name>
              <description>Loop Count Value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESULT_1</name>
                  <description>Result is from initial conversion in command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESULT_2</name>
                  <description>Result is from second conversion in command.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_2</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_3</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_4</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_5</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_6</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_7</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_8</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_9</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_10</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_11</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_12</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_13</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_RESULT_14</name>
                  <description>Result is from (LOOPCNT + 1) conversion in command.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESULT_16</name>
                  <description>Result is from 16th conversion in command.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDSRC</name>
              <description>Command Buffer Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_VALID</name>
                  <description>Not a valid value CMDSRC value for a data word in RESFIFO. 0h is only found in the initial FIFO state, prior to the storage of an ADC conversion result into a RESFIFO buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD1</name>
                  <description>CMD1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_2</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_3</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_4</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_5</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_6</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_7</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_8</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_9</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_10</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_11</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_12</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_13</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRESPONDING_CMD_14</name>
                  <description>Corresponding command buffer used as control settings for this conversion.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD15</name>
                  <description>CMD15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>FIFO Entry is Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_VALID</name>
                  <description>FIFO is empty. Discard any read from RESFIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>FIFO contains data. FIFO record read from RESFIFO is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>33</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CAL_GAR[%s]</name>
          <description>Calibration General A-Side Registers</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAL_GAR_VAL</name>
              <description>Calibration General A Side Register Element</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>33</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CAL_GBR[%s]</name>
          <description>Calibration General B-Side Registers</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAL_GBR_VAL</name>
              <description>Calibration General B Side Register Element</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
